Anoveg34/esp32-s3-usb-wifi-bridge/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# N16R8: 16MB Quad flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_TWO_OTA_LARGE=y

# N16R8: 8MB Octal PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# USB protocol: RNDIS (default) or NCM. Switch in Example Configuration.
CONFIG_EXAMPLE_USB_NET_MODE_RNDIS=y
CONFIG_TINYUSB_NET_MODE_ECM_RNDIS=y
# CONFIG_TINYUSB_NET_MODE_NCM is not set
CONFIG_TINYUSB_DESC_PRODUCT_STRING="ESP32-S3 USB Ethernet"

# TinyUSB owns native USB (GPIO19/20). Keep logs on UART0.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# SoftAP NAT so phones can browse http://192.168.4.1 and reach the PC WAN
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
